Revit 2026 API

# GuidEnum Properties

---

The GuidEnum type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Guid | The Guid of GUID-based enum object. |

#### Reference

GuidEnum Class

Autodesk.Revit.DB Namespace